[
  "obsidian-paste-image-rename",
  "obsidian-git",
  "obsidian-excalidraw-plugin",
  "table-editor-obsidian",
  "obsidian-link-converter",
  "ini-obsidian",
  "url-into-selection",
  "remember-cursor-position",
  "obsidian-wrap-with-shortcuts",
  "mermaid-tools",
  "image-captions",
  "obsidian-linter",
  "obsidian-outliner",
  "obsidian-emoji-toolbar",
  "snippet-commands-obsidian"
]